import React from "react";
import IMG from "../../assets/img/profile-img.png";

export default function RuleServer() {
  return (
    <>
      <section id="about" className="about">
        <div className="container">
          <div className="section-title">
            <h2>Rule Server</h2>
          </div>
          <div className="row">
            <div
              className="col-lg-12 pt-4 pt-lg-0 content"
              data-aos="fade-reight"
            >
              <h3>กฏและข้อบังคับ</h3>
              <p className="fst-italic"></p>
              <div className="row">
                <div className="col-lg-12">
                  <ul>
                    <li>
                      <i className="bi bi-chevron-right" />
                      <span>
                        1. Monster ทุกตัวภายในเกมส์ :
                        ทุกคนมีสิทธิในการล่าเท่าเทียมกัน
                        ทางไม่รับแจ้งการแจมทุกกรณี เพราะในเคสนี้
                        ถ้าเข้าไปยุ่งจะเกิดความไม่พอใจจากผู้เล่นทันที
                        ไม่ว่าเราจะตัดสินให้ฝั่งใดมีความผิด
                        สุดท้ายแล้วจะเป็นที่โดนด่า ดังนั้น เมื่อเกิดการแจม
                        มอนสเตอร์กันขึ้นระหว่างผู้เล่น
                        เป็นสิทธิของผู้เล่นที่จะพิจารณาเอาเองว่า จะแจมกลับ
                        ต่อสู้เพื่อแย่งชิง มอนสเตอร์นั้นๆ หรือจะแยกไปหา
                        มอนสเตอร์หรือแหล่งเก็บ เลเวลแห่งใหม่
                      </span>
                    </li>
                    <li>
                      <i className="bi bi-chevron-right" />
                      <span>
                        2. ในกรณีที่เกิดข้อพิพาทระหว่างผู้เล่น :
                        ใช้สกิลต่างๆแกล้งกันไปมา
                        ตรงจุดนี้ให้ถือว่าผู้เล่นจะเป็นผู้พิจารณาเองว่า
                        จะแก้ไขอย่างไร จะแกล้งกันอยู่อย่างนั้น
                        หรือใช้วิธีใดๆเพื่อให้กลับมาเล่นได้ หรือจะย้ายแม็พ
                        เก็บเลเวล ก็เป็นเรื่องที่ผู้เล่นต้องตัดสินใจเอง
                        ไม่รับแจ้งเคสใช้สกิลแกล้งกันไปมา
                        ยกเว้นการเปิดวาร์ปแกล้งกันและสกิลในข้อ 3
                        ให้ไม่สามารถเก็บไอเทมได้ซึ่งหลักฐานจะต้องมีความชัดเจนว่าผู้เล่นนั้นได้กระทำจริงๆ
                        จึงจะมีบทลงโทษได้และการตัดสินของถือเป็นอันสิ้นสุด
                      </span>
                    </li>
                    <li>
                      <i className="bi bi-chevron-right" />
                      <span>
                        3. การ ใช้สกิลTrap , ICE Wall และ Warp Protal :
                        ไม่ให้ผู้เล่นอื่นเก็บไอเทม ทั้ง Monster ทั่วไป และ MVP
                        มีความผิด จะไม่สนว่าไอเทมนั้นเป็นของฝ่ายใด
                        เพราะไม่สามารถตรวจสอบได้ จะพิจารณาจากการกระทำและใช้
                        สกิลเท่านั้น
                        ถ้าเป็นการรบกวนไม่ให้ผู้เล่นใดๆก็ตามเก็บไอเทมได้
                        ถือว่ามีความผิด
                      </span>
                    </li>
                    <li>
                      <i className="bi bi-chevron-right" />
                      <span>
                        4. การลากเทรน : ถือว่าเกมส์นี้
                        เป็นเกมส์เก็บเลเวลแบบเดินหามอนสเตอร์
                        ไม่ว่าจะเล่นแบบเดี่ยว หรือเป็นปาร์ตี้
                        ในกรณีที่ผู้เล่นไม่ว่างอยู่หน้าจอ
                        หรือไม่พร้อมควบคุมตัวละคร ให้ผู้เล่นนั้น ทำการล๊อคเอาท์
                        หรือ นำตัวละครนั้นๆไปอยู่ในจุดที่ปลอดภัยเอง
                        ไม่รับแจ้งการลากเทรน ใส่กัน ทุกกรณี
                      </span>
                    </li>
                  </ul>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
}
